{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.6.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 64, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d", "batch_input_shape": [null, 64, 64, 3], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 64, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1]}}, {"class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "average_pooling2d", "padding": "valid", "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout", "noise_shape": null, "rate": 0.2, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 128, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 128, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1]}}, {"class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "average_pooling2d_1", "padding": "valid", "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.2, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 128, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "padding": "valid", "bias_regularizer": null, "data_format": "channels_last", "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1]}}, {"class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "average_pooling2d_2", "padding": "valid", "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.2, "dtype": "float32"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "flatten"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_3", "noise_shape": null, "rate": 0.5, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_regularizer": null, "units": 512, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "name": "dense"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_4", "noise_shape": null, "rate": 0.2, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_regularizer": null, "units": 4, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1"}}], "name": "sequential"}}, "training_config": {"loss_weights": null, "weighted_metrics": null, "metrics": ["acc"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"epsilon": 1e-07, "decay": 0.0, "amsgrad": false, "beta_1": 0.8999999761581421, "learning_rate": 9.999999747378752e-05, "beta_2": 0.9990000128746033, "name": "Adam"}}, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [128], "dtype": "float32"}, {"name": "dense/kernel", "shape": [3200, 512], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 4], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [4], "dtype": "float32"}]}]}